cmsis-svd/cmsis-svd/data/SiliconLabs/EFM32PG22/EFM32PG22C200F32IM32.svd
        <register>
          <name>EXTIPINSELL</name>
          <description>External Interrupt Pin Select Low</description>
          <addressOffset>0x408</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x33333333</resetMask>
          <fields>
            <field>
              <name>EXTIPINSEL0</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL1</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL2</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL3</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL4</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL5</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL6</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL7</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIPINSELH</name>
          <description>External Interrupt Pin Select High</description>
          <addressOffset>0x40C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003333</resetMask>
          <fields>
            <field>
              <name>EXTIPINSEL0</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET8</name>
                  <description>OFFSET=8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET9</name>
                  <description>OFFSET=9</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET10</name>
                  <description>OFFSET=10</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET11</name>
                  <description>OFFSET=11</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL1</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET8</name>
                  <description>OFFSET=8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET9</name>
                  <description>OFFSET=9</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET10</name>
                  <description>OFFSET=10</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET11</name>
                  <description>OFFSET=11</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL2</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET8</name>
                  <description>OFFSET=8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET9</name>
                  <description>OFFSET=9</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET10</name>
                  <description>OFFSET=10</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET11</name>
                  <description>OFFSET=11</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL3</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET8</name>
                  <description>OFFSET=8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET9</name>
                  <description>OFFSET=9</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET10</name>
                  <description>OFFSET=10</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET11</name>
                  <description>OFFSET=11</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIRISE</name>
          <description>External Interrupt Rising Edge Trigger</description>
          <addressOffset>0x410</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>EXTIRISE</name>
              <description>EXT Int Rise</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIFALL</name>
          <description>External Interrupt Falling Edge Trigger</description>
          <addressOffset>0x414</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>EXTIFALL</name>
              <description>EXT Int FALL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>Interrupt Flag</description>
          <addressOffset>0x420</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF0FFF</resetMask>
          <fields>
            <field>
              <name>EXTIF0</name>
              <description>External Pin Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTIF1</name>
              <description>External Pin Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTIF2</name>
              <description>External Pin Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTIF3</name>
              <description>External Pin Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTIF4</name>
              <description>External Pin Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTIF5</name>
              <description>External Pin Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTIF6</name>
              <description>External Pin Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTIF7</name>
              <description>External Pin Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTIF8</name>
              <description>External Pin Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTIF9</name>
              <description>External Pin Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTIF10</name>
              <description>External Pin Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTIF11</name>
              <description>External Pin Flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM4WU</name>
              <description>EM4 wake up</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
